In [43]:
# Import Libraries and Dependencies
import pandas as pd
from pathlib import Path

### 1. Combine and Clean the Data
#### Import CSVs

In [44]:
# Read the CSV files into DataFrames.

# Year 2020
athletic_sales_2020 = 'athletic_sales_2020.csv'
df_2020 = pd.read_csv(athletic_sales_2020)

# Year 2021
athletic_sales_2021 = 'athletic_sales_2021.csv'
df_2021 = pd.read_csv(athletic_sales_2021)

In [45]:
# Display the 2020 sales DataFrame
df_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [46]:
# Display the 2021 sales DataFrame
df_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [47]:
# Check the 2020 sales data types.
# type(df_2020)
# print(type(df_2020))
print(df_2020.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [48]:
# Check the 2021 sales data types.
# type(df_2021)
# print(type(df_2021))
print(df_2021.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [49]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
# Used Python 3 from geeksforgeeks website as reference. https://www.geeksforgeeks.org/pandas-concat-function-in-python/
# In addition, used homeworks from chapter 5 as references.

# Concatenating:
combined_df = pd.concat([df_2020, df_2021], ignore_index=True)

# Dropping the index:
combined_df = combined_df.reset_index(drop=True)

In [50]:
# Check if any values are null.
# Used coding from in-class exercise from chapter 5 as reference. 
combined_df.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [51]:
# Check the data type of each column
# Used coding from in-class exercise from chapter 5 as reference. 
column_data_type = combined_df.dtypes
column_data_type

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [52]:
# Convert the "invoice_date" to a datetime datatype
# Used coding from in-class exercise from chapter 5 as reference. 
combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

C:\Users\lovel\AppData\Local\Temp\ipykernel_11648\857631578.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

In [53]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_df.dtypes)

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [54]:
# Show the number products sold for region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
# Rename the sum to "Total_Products_Sold".
total_products_sold = combined_df.groupby(['region', 'state', 'city']).size().reset_index(name='Total_Products_Sold')

# Show the top 5 results.
total_products_sold.head(5)

    region     state          city  Total_Products_Sold
0  Midwest  Illinois       Chicago                  144
1  Midwest   Indiana  Indianapolis                  144
2  Midwest      Iowa    Des Moines                  144
3  Midwest    Kansas       Wichita                  144
4  Midwest  Michigan       Detroit                  144

#### Using `pivot_table`

In [55]:
# Show the number products sold for region, state, and city.
# number products = units_sold
# Used coding from in-class exercise from chapter 5 as reference. 
number_products_sold = pd.pivot_table(combined_df,
                                      index = ['region' , 'state' , 'city'] ,
                                      values = 'units_sold' ,
                                      aggfunc = 'sum')

# Rename the "units_sold" column to "Total_Products_Sold"
number_products_sold = number_products_sold.rename(columns={"units_sold" : "Total_Products_Sold"})

# Show the top 5 results.
number_products_sold.head(5)

                               Total_Products_Sold
region  state    city
Midwest Illinois Chicago                     25407
        Indiana  Indianapolis                26332
        Iowa     Des Moines                  23446
        Kansas   Wichita                     29463
        Michigan Detroit                     50095

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [56]:
# Show the total sales for the products sold for each region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
# Rename the "total_sales" column to "Total Sales"
total_sales = combined_df.groupby(['region' , 'state' , 'city'])['total_sales'].sum().reset_index()

# Show the top 5 results.
total_sales.head(5)

    region     state          city  total_sales
0  Midwest  Illinois       Chicago      9797488
1  Midwest   Indiana  Indianapolis      8836198
2  Midwest      Iowa    Des Moines      7424011
3  Midwest    Kansas       Wichita      9972864
4  Midwest  Michigan       Detroit     18625433

#### Using `pivot_table`

In [57]:
# Show the total sales for the products sold for each region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
total_sales_products = pd.pivot_table(combined_df,
                                      index = ['region' , 'state' , 'city'] ,
                                      values = 'total_sales' ,
                                      aggfunc = 'sum')

# Optional: Rename the "total_sales" column to "Total Sales"
total_sales_products = total_sales_products.rename(columns={"total_sales" : "Total Sales"})


# Show the top 5 results.
total_sales_products.head(5)

                               Total Sales
region  state    city
Midwest Illinois Chicago           9797488
        Indiana  Indianapolis      8836198
        Iowa     Des Moines        7424011
        Kansas   Wichita           9972864
        Michigan Detroit          18625433

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [58]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
# Rename the "total_sales" column to "Total Sales"
total_sales_retailer = combined_df.groupby(['retailer' , 'region' , 'state' , 'city'])['total_sales'].sum().reset_index()
total_sales_retailer = total_sales_retailer.rename(columns={"total_sales" : "Total Sales"})

# Show the top 5 results.
total_sales_retailer.head(5)

  retailer     region          state        city  Total Sales
0   Amazon    Midwest           Ohio    Columbus     16835873
1   Amazon  Northeast          Maine    Portland      8611395
2   Amazon  Northeast  Massachusetts      Boston      4193590
3   Amazon  Northeast  New Hampshire  Manchester     10077142
4   Amazon  Northeast        Vermont  Burlington     13380463

#### Using `pivot_table`

In [59]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
total_retailer = pd.pivot_table(combined_df,
                                index = ['retailer' , 'region' , 'state' , 'city'] ,
                                values = 'total_sales' ,
                                aggfunc = 'sum')

# Optional: Rename the "total_sales" column to "Total Sales"
total_retailer = total_retailer.rename(columns={"total_sales" : "Total Sales"})

# Show the top 5 results.
total_retailer.head(5)

                                             Total Sales
retailer region    state         city
Amazon   Midwest   Ohio          Columbus       16835873
         Northeast Maine         Portland        8611395
                   Massachusetts Boston          4193590
                   New Hampshire Manchester     10077142
                   Vermont       Burlington     13380463

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [60]:
# Filter the sales data to get the women's athletic footwear sales data.
# Used coding from in-class exercise from chapter 5 as reference.

#### Using `groupby`

In [61]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Used coding from in-class exercise from chapter 5 as reference. 
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.

#### Using `pivot_table`

In [62]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [63]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the table.

In [64]:
# Resample the pivot table into daily bins, and get the total sales for each day.


# Sort the resampled pivot table in ascending order on "Total Sales".

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [65]:
# Resample the pivot table into weekly bins, and get the total sales for each week.


# Sort the resampled pivot table in ascending order on "Total Sales".